2309/src/Catalogs/tokens/tokens.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>tokens</name>
  <attributes>
    <name>account</name>
    <type>
      <types>CatalogRef.accounts</types>
    </type>
  </attributes>
  <attributes>
    <name>appType</name>
    <type>
      <types>EnumRef.appTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>appVersion</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>chain</name>
    <type>
      <types>CatalogRef.chains</types>
    </type>
  </attributes>
  <attributes>
    <name>changeDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>createDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>deviceModel</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>deviceToken</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>holding</name>
    <type>
      <types>CatalogRef.holdings</types>
    </type>
  </attributes>
  <attributes>
    <name>lockDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>systemType</name>
    <comment>Операционная система устройства</comment>
    <type>
      <types>EnumRef.systemTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>systemVersion</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>timeZone</name>
    <type>
      <types>CatalogRef.timeZones</types>
    </type>
  </attributes>
  <attributes>
    <name>underControl</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>user</name>
    <type>
      <types>CatalogRef.users</types>
    </type>
  </attributes>
</mdclass:Catalog>

2309/src/Catalogs/tokens/ManagerModule.bsl
Procedure PresentationFieldsGetProcessing(fields, standardProcessing)
	standardProcessing = False;	
	array = New Array();	
	array.Add("appType");
	array.Add("systemType");
	array.Add("createDate");		
	fields = array;	
EndProcedure

Procedure PresentationGetProcessing(data, presentation, standardProcessing)
	standardProcessing = False;
	presentation = "" + data.appType + " / " + data.systemType + " / " + Format(data.createDate, "DF='dd.MM.yyyy HH:mm'");
EndProcedure
